<summary>terraform plan</summary>

<details>

```tf
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.app.aws_appautoscaling_target.app_web_scale will be updated in-place
  ~ resource "aws_appautoscaling_target" "app_web_scale" {
        id                 = "service/staging_app/staging_app_web_service"
      ~ max_capacity       = 0 -> 2
      ~ min_capacity       = 0 -> 1
        # (4 unchanged attributes hidden)
    }

  # module.app.aws_ecs_task_definition.app_web must be replaced
-/+ resource "aws_ecs_task_definition" "app_web" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-1:464352955943:task-definition/staging_app_web_task:2" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  ~ image            = "464352955943.dkr.ecr.ap-northeast-1.amazonaws.com/nginx-sample:latest" -> "464352955943.dkr.ecr.ap-northeast-1.amazonaws.com/rails-api:latest"
                  - mountPoints      = [] -> null
                  - volumesFrom      = [] -> null
                    # (7 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "staging_app_web_task" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
      - tags                     = {} -> null
        # (7 unchanged attributes hidden)
    }

  # module.app.aws_lb_target_group.app_web will be updated in-place
  ~ resource "aws_lb_target_group" "app_web" {
        id                                 = "arn:aws:elasticloadbalancing:ap-northeast-1:464352955943:targetgroup/staging-app-web/82acc7e9e551a097"
        name                               = "staging-app-web"
        tags                               = {
            "Environment" = "staging"
            "Name"        = "staging_app_web"
        }
        # (11 unchanged attributes hidden)

      ~ health_check {
          ~ path                = "/" -> "/health_check"
            # (8 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.db.aws_db_parameter_group.sample will be created
  + resource "aws_db_parameter_group" "sample" {
      + arn         = (known after apply)
      + description = "Aurora db instance parameter group"
      + family      = "aurora5.7"
      + id          = (known after apply)
      + name        = "sample-aurora57"
      + name_prefix = (known after apply)

      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_database"
          + value        = "utf8mb4"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_server"
          + value        = "utf8mb4"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "log_output"
          + value        = "FILE"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "log_queries_not_using_indexes"
          + value        = "0"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "long_query_time"
          + value        = "10"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "slow_query_log"
          + value        = "1"
        }
    }

  # module.db.aws_db_subnet_group.sample will be created
  + resource "aws_db_subnet_group" "sample" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "sample-app-db"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-0250cab6edcd0cb76",
          + "subnet-0d328a888d7ee01f6",
        ]
    }

  # module.db.aws_rds_cluster.aurora_cluster will be created
  + resource "aws_rds_cluster" "aurora_cluster" {
      + apply_immediately               = (known after apply)
      + arn                             = (known after apply)
      + availability_zones              = [
          + "ap-northeast-1a",
          + "ap-northeast-1c",
          + "ap-northeast-1d",
        ]
      + backup_retention_period         = 1
      + cluster_identifier              = "staging-sample-cluster"
      + cluster_identifier_prefix       = (known after apply)
      + cluster_members                 = (known after apply)
      + cluster_resource_id             = (known after apply)
      + copy_tags_to_snapshot           = false
      + database_name                   = (known after apply)
      + db_cluster_parameter_group_name = "sample-aurora57"
      + db_subnet_group_name            = "sample-app-db"
      + enable_http_endpoint            = false
      + enabled_cloudwatch_logs_exports = [
          + "error",
          + "slowquery",
        ]
      + endpoint                        = (known after apply)
      + engine                          = "aurora"
      + engine_mode                     = "provisioned"
      + engine_version                  = "5.7.mysql_aurora.2.09.1"
      + hosted_zone_id                  = (known after apply)
      + id                              = (known after apply)
      + kms_key_id                      = (known after apply)
      + master_password                 = (sensitive value)
      + master_username                 = "root"
      + port                            = 3306
      + preferred_backup_window         = "13:07-13:37"
      + preferred_maintenance_window    = "sat:19:00-sat:19:30"
      + reader_endpoint                 = (known after apply)
      + skip_final_snapshot             = false
      + storage_encrypted               = true
      + vpc_security_group_ids          = [
          + "sg-0d232ae423dae4eec",
        ]
    }

  # module.db.aws_rds_cluster_instance.aurora_instance[0] will be created
  + resource "aws_rds_cluster_instance" "aurora_instance" {
      + apply_immediately               = (known after apply)
      + arn                             = (known after apply)
      + auto_minor_version_upgrade      = true
      + availability_zone               = (known after apply)
      + ca_cert_identifier              = "rds-ca-2019"
      + cluster_identifier              = (known after apply)
      + copy_tags_to_snapshot           = false
      + db_parameter_group_name         = "sample-aurora57"
      + db_subnet_group_name            = "sample-app-db"
      + dbi_resource_id                 = (known after apply)
      + endpoint                        = (known after apply)
      + engine                          = "aurora"
      + engine_version                  = "5.7.mysql_aurora.2.09.1"
      + id                              = (known after apply)
      + identifier                      = "staging-sample-0"
      + identifier_prefix               = (known after apply)
      + instance_class                  = "db.t2.small"
      + kms_key_id                      = (known after apply)
      + monitoring_interval             = 60
      + monitoring_role_arn             = "arn:aws:iam::046977594715:role/rds-monitoring-role"
      + performance_insights_enabled    = (known after apply)
      + performance_insights_kms_key_id = (known after apply)
      + port                            = (known after apply)
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = (known after apply)
      + promotion_tier                  = 1
      + publicly_accessible             = false
      + storage_encrypted               = (known after apply)
      + tags                            = {
          + "Environment" = "staging"
          + "Name"        = "sample-app-staging-db-0"
          + "Project"     = "sample-app"
        }
      + writer                          = (known after apply)
    }

  # module.db.aws_rds_cluster_instance.aurora_instance[1] will be created
  + resource "aws_rds_cluster_instance" "aurora_instance" {
      + apply_immediately               = (known after apply)
      + arn                             = (known after apply)
      + auto_minor_version_upgrade      = true
      + availability_zone               = (known after apply)
      + ca_cert_identifier              = "rds-ca-2019"
      + cluster_identifier              = (known after apply)
      + copy_tags_to_snapshot           = false
      + db_parameter_group_name         = "sample-aurora57"
      + db_subnet_group_name            = "sample-app-db"
      + dbi_resource_id                 = (known after apply)
      + endpoint                        = (known after apply)
      + engine                          = "aurora"
      + engine_version                  = "5.7.mysql_aurora.2.09.1"
      + id                              = (known after apply)
      + identifier                      = "staging-sample-1"
      + identifier_prefix               = (known after apply)
      + instance_class                  = "db.t2.small"
      + kms_key_id                      = (known after apply)
      + monitoring_interval             = 60
      + monitoring_role_arn             = "arn:aws:iam::046977594715:role/rds-monitoring-role"
      + performance_insights_enabled    = (known after apply)
      + performance_insights_kms_key_id = (known after apply)
      + port                            = (known after apply)
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = (known after apply)
      + promotion_tier                  = 1
      + publicly_accessible             = false
      + storage_encrypted               = (known after apply)
      + tags                            = {
          + "Environment" = "staging"
          + "Name"        = "sample-app-staging-db-1"
          + "Project"     = "sample-app"
        }
      + writer                          = (known after apply)
    }

  # module.db.aws_rds_cluster_parameter_group.sample will be created
  + resource "aws_rds_cluster_parameter_group" "sample" {
      + arn         = (known after apply)
      + description = "Aurora cluster parameter group"
      + family      = "aurora5.7"
      + id          = (known after apply)
      + name        = "sample-aurora57"
      + name_prefix = (known after apply)

      + parameter {
          + apply_method = "immediate"
          + name         = "log_output"
          + value        = "FILE"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "log_queries_not_using_indexes"
          + value        = "0"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "long_query_time"
          + value        = "10"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "slow_query_log"
          + value        = "1"
        }
    }

Plan: 7 to add, 2 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```

</details>